---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d
source: html/6c76cb46-4f72-5ddb-3214-7dde798d9b6e.htm
---
# AssetPropertyDoubleArray3d Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.